src/Catalogs/ТиповыеПродукты1С/ТиповыеПродукты1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТиповыеПродукты1С</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОповещатьОВыходеНовойВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>EnumRef.ТипыПродуктов1С</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиОповещений</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>String</types>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Клиенты</types>
        <types>CatalogRef.Исполнители</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ТиповыеПродукты1С/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОповещатьОВыходеНовойВерсииПриИзменении(Элемент)
	
	УправлениеВидимостью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостью();
	
КонецПроцедуры

Процедура УправлениеВидимостью()
	
	Элементы.ПолучателиОповещений.Доступность = Объект.ОповещатьОВыходеНовойВерсии;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиОповещенийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Получатель) Тогда
		Если ТипЗнч(Элемент.ТекущиеДанные.Получатель) = Тип("Строка") Тогда
			Если НЕ ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Элемент.ТекущиеДанные.Получатель) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Введенный адрес электронной почты не соответствует формату!");
				Элемент.ТекущиеДанные.Получатель = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
